; domain
(define (domain valueflows)


(:requirements :strips :typing :adl )

(:types 
    thing
    resource - thing 
    actor - thing
    vehicle - resource
    truck - vehicle
    car - vehicle
    resourceClass
    location
    action
)

; un-comment following line if constants are needed
(:constants 
    transfer move goto transfer-all-rights transfer-custody mount dismount put-into take-out-of begin-use end-use use send-and-transfer deliver-taxi-service deliver-transport-service lend leave arrive drive travel - action
    null - thing
)

(:predicates 
    (currentLocation ?t - thing ?l - location) ; t is at location l
    (resourceClassification ?r - resource ?c - resourceClass )
    (custodian ?r - resource ?a - actor ) ; a is currently in custody of r
    (primaryAccountable ?r - resource ?a - actor) ; a is the owner of r
    (intent ?action - action ?provider ?receiver - actor ?r - resource ?l - location)
    (commitment ?action - action ?provider ?receiver - actor ?r - resource ?l - location)
    (fulfillment ?action - action ?provider ?receiver - actor ?r - resource ?l - location)
    (using ?a - actor ?r - resource) ; a is using r
    (isCarryable ?r - resource) ; an actor can move the resource
    (isVehicle ?r - resource) ; r is a vehicle
    (isPassive ?a - actor) ; actor cannot be in the provider/receiver role
    (mayContainResources ?r - resource) ; a truck, for example
    (mayContainActors ?a - actor) ; a means of person transport
    (containedIn ?rinside - thing ?rcontainer - resource) ; rinside is inside rcontainer
)


;(:functions (total-cost))

(:action commit 
    :parameters (?action - action ?provider ?receiver - actor ?resource - resource ?location - location)
    :precondition 
        (intent ?action ?provider ?receiver ?resource ?location)
    :effect (and
        (commitment ?action ?provider ?receiver ?resource ?location)
    )
)

; not good - incurs high complexity
; (:action travel-recipe
;     :parameters (?traveller - actor ?fromLocation ?toLocation - location)
;     :precondition (and 
;         (not (= ?fromLocation ?toLocation))
;         (or
;             (intent travel ?traveller ?traveller null ?toLocation)
;             (intent travel ?traveller ?traveller null null)
;             (exists (?someCar - vehicle)
;                 (or
;                     (intent travel ?traveller ?traveller ?someCar null)
;                     (intent travel ?traveller ?traveller ?someCar ?toLocation)
;                 )
;             )
;         )
;         (or 
;             (currentLocation ?traveller ?fromLocation)
;             (exists (?someDriver - actor ?someCar - car)
;                 (commitment dismount ?someDriver ?traveller ?someCar ?fromLocation)    
;             )
;             (exists (?someCar - car)
;                 (commitment move ?traveller ?traveller ?someCar ?fromLocation)    
;             )
;         )
;     )
;     :effect (and 
;         (intent leave ?traveller ?traveller null ?fromLocation)
;         (intent arrive ?traveller ?traveller null ?toLocation)
;     )
; )

(:action drive-recipe
    :parameters (?driver - actor ?car - resource ?fromLocation ?toLocation - location)
    :precondition (and 
        (not (= ?fromLocation ?toLocation))
        (intent drive ?driver ?driver ?car null)
        (isVehicle ?car)
        (or
            (and 
                (intent leave ?driver ?driver null ?fromLocation)
                (intent arrive ?driver ?driver null ?toLocation)
            )
            (and 
                (intent leave ?driver ?driver ?car ?fromLocation)
                (intent arrive ?driver ?driver ?car ?toLocation)
            )
        )
    )
    :effect (and 
        (intent use ?driver ?driver ?car ?fromLocation)
        (intent move ?driver ?driver ?car ?toLocation)
    )
)

(:action taxi-recipe
    :parameters (?driver ?passenger - actor  ?car - resource ?fromLocation ?toLocation - location)
    :precondition (and 
        (not (= ?fromLocation ?toLocation))
        (intent deliver-taxi-service ?driver null ?car null) ;TODO or with null car
        (intent leave ?passenger ?passenger null ?fromLocation)
        (intent arrive ?passenger ?passenger null ?toLocation)
    )
    :effect (and 
        (forall (?driverLocation - location )
            (when
                (and
                    (currentLocation ?driver ?driverLocation)
                    (not (= ?driverLocation ?fromLocation))
                )
                (and
                    (intent drive ?driver ?driver ?car null)
                    (intent leave ?driver ?driver ?car ?driverLocation)
                    (intent arrive ?driver ?driver ?car ?fromLocation)
                )
            )
        )
        (intent use ?driver ?driver ?car ?fromLocation)
        (intent mount ?driver ?passenger ?car ?fromLocation)
        (intent move ?driver ?driver ?car ?toLocation)
        (intent dismount ?driver ?passenger ?car ?toLocation)
        (intent travel ?driver ?driver ?car null) ; intend to go back home
    )
)

(:action transport-recipe
    :parameters (?transporter ?consignor ?consignee - actor  ?truck ?consignment - resource ?fromLocation ?toLocation - location)
    :precondition (and 
        (not (= ?fromLocation ?toLocation))
        (not (= ?consignor ?consignee))
        (not (= ?consignor ?transporter))
        (not (= ?transporter ?consignee))
        (isVehicle ?truck)
        (mayContainResources ?truck)
        (or 
            (intent deliver-transport-service ?transporter null ?truck null)
            (intent deliver-transport-service ?transporter null null null)
        )
        (intent transfer-custody ?consignor null ?consignment ?fromLocation )
        (intent transfer-custody null ?consignee ?consignment ?toLocation )
    )
    :effect (and 
        (forall (?transporterLocation - location )
            (when
                (and
                    (currentLocation ?transporter ?transporterLocation)
                    (not (= ?transporterLocation ?fromLocation))
                )
                (and
                    (intent drive ?transporter ?transporter ?truck null)
                    (intent leave ?transporter ?transporter ?truck ?transporterLocation)
                    (intent arrive ?transporter ?transporter ?truck ?fromLocation)
                )
            )
        )
        (intent transfer-custody ?consignor ?transporter ?consignment ?fromLocation)
        (intent use ?transporter ?transporter ?truck ?fromLocation)
        (intent move ?transporter ?transporter ?truck ?toLocation)
        (intent transfer-custody ?transporter ?consignee ?consignment ?toLocation)
    )
)

(:action borrow-recipe
    :parameters (?lender ?borrower - actor ?resource - resource ?location - location)
    :precondition (and 
        (primaryAccountable ?resource ?lender)
        (not (= ?lender ?borrower))
        (or
            (intent lend ?lender null ?resource null)
            (intent lend ?lender null ?resource ?location)
        )
        (or
            (exists (?useLocation - location )
                (intent use ?borrower ?borrower ?resource ?useLocation)
            )
            (intent use ?borrower ?borrower ?resource null)
        )
    )
    :effect (and
        (forall (?borrowerLocation - location )
            (when
                (and
                    (currentLocation ?borrower ?borrowerLocation)
                    (not (= ?borrowerLocation ?location))
                )
                (and
                    (intent leave ?borrower ?borrower null ?borrowerLocation)
                    (intent arrive ?borrower ?borrower null ?location)
                )
            )
        )
        (intent transfer-custody ?lender ?borrower ?resource ?location)
        (intent use ?borrower ?borrower ?resource ?location )
        (intent transfer-custody ?borrower ?lender ?resource ?location)
    )
)

(:action send-and-transfer-recipe
    :parameters (?sender ?receiver - actor ?resource - resource ?fromLocation ?toLocation - location)
    :precondition (and 
        (not (= ?fromLocation ?toLocation))
        (not (= ?sender ?receiver))
        (primaryAccountable ?resource ?sender)
        (intent send-and-transfer ?sender null ?resource ?fromLocation)
        (intent send-and-transfer null ?receiver ?resource ?toLocation)
    )    
    :effect (and
        (intent transfer-all-rights ?sender ?receiver ?resource ?fromLocation)
        (intent transfer-custody ?sender null ?resource ?fromLocation)
        (intent transfer-custody null ?receiver ?resource ?toLocation)
    )
)   


(:action move 
    :parameters (?a - actor ?r - resource ?fromLocation ?toLocation - location)
    :precondition ( and
        (not (isPassive ?a))
        (currentLocation ?r ?fromLocation)
        (currentLocation ?a ?fromLocation)
        (custodian ?r ?a)
        (commitment move ?a ?a ?r ?toLocation)
        (or
            (isCarryable ?r) ; actor carries it
            (and 
                (isVehicle ?r) ; actor drives it
                (using ?a ?r) ; actor uses it
            )
        )
    )
    :effect ( and
        (not (currentLocation ?r ?fromLocation))
        (not (currentLocation ?a ?fromLocation))
        (currentLocation ?r ?toLocation)
        (currentLocation ?a ?toLocation)
        (fulfillment move ?a ?a ?r ?toLocation)
        (forall (?t - thing )
            (when 
                (containedIn ?t ?r)
                (and 
                    (currentLocation ?t ?toLocation)
                    (not (currentLocation ?t ?fromLocation))
                )
            )
        )
    )
)

(:action put-into
    :parameters (?a - actor ?r ?rContainer - resource)
    :precondition (and 
        (not (isPassive ?a))
        (custodian ?r ?a)
        (custodian ?rcontainer ?a)
        (mayContainResources ?rContainer)
        (exists (?l - location ) 
            (and
                (currentLocation ?r ?l)
                (currentLocation ?rContainer ?l)
            )
        )
        (not (exists (?otherContainer - resource) (containedIn ?r ?rContainer)))
    )
    :effect (and 
        (containedIn ?r ?rContainer)
    )
)


(:action take-out-of
    :parameters (?a - actor ?r ?rContainer - resource)
    :precondition (and
        (not (isPassive ?a))
        (containedIn ?r ?rContainer)
        (custodian ?rcontainer ?a)
    )
    :effect 
        (and
            (not (containedIn ?r ?rContainer))
        )
)


(:action mount
    :parameters (?driver ?passenger - actor ?vehicle - resource ?l - location)
    :precondition (and 
        (isVehicle ?vehicle)
        (not (isPassive ?driver))
        (not (isPassive ?passenger))
        (using ?driver ?vehicle)
        (mayContainActors ?vehicle)
        (commitment mount ?driver ?passenger ?vehicle ?l)            
        (currentLocation ?driver ?l)
        (currentLocation ?vehicle ?l)
        (currentLocation ?passenger ?l)
        (not (exists (?otherContainer - resource) (containedIn ?passenger ?vehicle)))
        (not 
            (exists (?res - resource )
                (and  
                    (custodian ?res ?passenger)
                    (not (isCarryable ?res))
                )
            )
        )
    )
    :effect (and 
        (containedIn ?passenger ?vehicle)
        (isPassive ?passenger)
        (fulfillment mount ?driver ?passenger ?vehicle ?l)            
    )
)

(:action dismount
    :parameters (?driver ?passenger - actor ?vehicle - resource ?l - location)
    :precondition (and 
        (isVehicle ?vehicle)
        (not (isPassive ?driver))
        (custodian ?vehicle ?driver)
        (containedIn ?passenger ?vehicle)
        (currentLocation ?driver ?l)
        (currentLocation ?vehicle ?l)
        (currentLocation ?passenger ?l)
        (commitment dismount ?driver ?passenger ?vehicle ?l)
    )
    :effect 
        (and
            (not (containedIn ?passenger ?vehicle))
            (not (isPassive ?passenger))
            (fulfillment dismount ?driver ?passenger ?vehicle ?l)
        )
)

(:action begin-use
    :parameters (?a - actor ?r - resource)
    :precondition ( and
        (exists (?l - location) 
            (and
                (currentLocation ?r ?l)
                (currentLocation ?a ?l)
                (commitment use ?a ?a ?r ?l)
            )
        )
        (not (isPassive ?a))
        (custodian ?r ?a)
        (not (exists(?a2 - actor) (using ?a2 ?r)))
    )
    :effect (and
        (using ?a ?r)
        (fulfillment use ?a ?a ?r ?l)
    )
)


(:action end-use
    :parameters (?a - actor ?r - resource)
    :precondition 
        (and 
            (using ?a ?r)
            (not (isPassive ?a))
        )
    :effect 
        (and
            (not(using ?a ?r))
        )
)

(:action transfer-custody
    :parameters (?provider ?receiver - actor ?r - resource ?l - location)
    :precondition (and
        (not (isPassive ?provider))
        (not (isPassive ?receiver))
        (custodian ?r ?provider)
        (not (= ?provider ?receiver))
        (currentLocation ?provider ?l) 
        (currentLocation ?receiver ?l)
        (currentLocation ?r ?l)
        (commitment transfer-custody ?provider ?receiver ?r ?l) 
        (not (exists (?container - resource) (containedIn ?r ?container)))
    )
    :effect(and
        (not (custodian ?r ?provider))
        (custodian ?r ?receiver)
        (fulfillment transfer-custody ?provider ?receiver ?r ?l) 
    )
)

(:action transfer-all-rights
    :parameters (?provider ?receiver - actor ?r - resource ?l - location)
    :precondition 
        ( and 
            (primaryAccountable ?r ?provider)
            (not (isPassive ?provider))
            (not (isPassive ?receiver)) ;questionable
            (currentLocation ?provider ?l)
            (commitment transfer-all-rights ?provider ?receiver ?r ?l) 
        )
    :effect 
        ( and
            (not(primaryAccountable ?r ?provider))
            (primaryAccountable ?r ?receiver)
            (fulfillment transfer-all-rights ?provider ?receiver ?r ?l) 
        )
)

(:action transfer
    :parameters (?provider - actor ?receiver - actor ?r - resource ?l - location)
    :precondition 
        ( and 
            (not (isPassive ?provider))
            (not (isPassive ?receiver))
            (custodian ?r ?provider)
            (primaryAccountable ?r ?provider)
            (currentLocation ?provider ?l) 
            (currentLocation ?receiver ?l)
            (currentLocation ?r ?l)
            (commitment transfer ?provider ?receiver ?r ?l) 
            (not (exists (?container - resource) (containedIn ?r ?container)))
        )
    :effect 
        ( and
            (not(primaryAccountable ?r ?provider))
            (not (custodian ?r ?provider))
            (primaryAccountable ?r ?receiver)
            (custodian ?r ?receiver)            
            (fulfillment transfer ?provider ?receiver ?r ?l) 
        )
)

)

; problem
(define 
    (problem simple-move) 
    (:domain valueflows)
(:objects 
    Apples - resource
    Rossatz Krems Wien Gedersdorf - location
    Rolf Alice Bob Claudia Maria - actor
    GrannySmith - resourceClass
    Truck1 - truck
    Car1 - car 
)

(:init
    
    (currentLocation Apples Rossatz)
    (currentLocation Alice Rossatz)
    (resourceClassification Apples GrannySmith)
    (custodian Apples Alice)
    (primaryAccountable Apples Alice)    
    (intent send-and-transfer Alice null Apples Rossatz)

    (currentLocation Bob Wien)
    (intent send-and-transfer null Bob Apples Wien)

    (currentLocation Rolf Gedersdorf)
    (currentLocation Truck1 Gedersdorf)
    (custodian Truck1 Rolf)
    (primaryAccountable Truck1 Rolf)
    (isVehicle Truck1)
    (mayContainResources Truck1)
    (intent lend Rolf null Truck1 Gedersdorf)

    (currentLocation Maria Krems)
    (currentLocation Car1 Krems)
    (custodian Car1 Maria)
    (isVehicle Car1)
    (mayContainActors Car1)
    (intent deliver-taxi-service Maria null Car1 null)

    (currentlocation Claudia Krems)    
    (intent deliver-transport-service Claudia null null null)
    
)

(:goal 
    (and
        (custodian Apples Bob)
        (custodian Truck1 Rolf)
        ;s(currentLocation Claudia Krems)
    )
)

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (send-and-transfer-recipe alice bob apples rossatz wien)
   added: (intent transfer-all-rights alice bob apples rossatz) (intent transfer-custody alice null apples rossatz) (intent transfer-custody null bob apples wien)
   goals met: 1 of 2
2. (transport-recipe claudia alice bob truck1 apples rossatz wien)
   added: (intent drive claudia claudia truck1 null) (intent leave claudia claudia truck1 krems) (intent arrive claudia claudia truck1 rossatz) (intent transfer-custody alice claudia apples rossatz) (intent use claudia claudia truck1 rossatz) (intent move claudia claudia truck1 wien) (intent transfer-custody claudia bob apples wien)
   goals met: 1 of 2
3. (borrow-recipe rolf claudia truck1 gedersdorf)
   added: (intent leave claudia claudia null krems) (intent arrive claudia claudia null gedersdorf) (intent transfer-custody rolf claudia truck1 gedersdorf) (intent use claudia claudia truck1 gedersdorf) (intent transfer-custody claudia rolf truck1 gedersdorf)
   goals met: 1 of 2
4. (taxi-recipe maria claudia car1 krems gedersdorf)
   added: (intent use maria maria car1 krems) (intent mount maria claudia car1 krems) (intent move maria maria car1 gedersdorf) (intent dismount maria claudia car1 gedersdorf) (intent travel maria maria car1 null)
   goals met: 1 of 2
5. (commit use maria maria car1 krems)
   added: (commitment use maria maria car1 krems)
   goals met: 1 of 2
6. (begin-use maria car1)
   added: (using maria car1) (fulfillment use maria maria car1 ?l)
   goals met: 1 of 2
7. (commit mount maria claudia car1 krems)
   added: (commitment mount maria claudia car1 krems)
   goals met: 1 of 2
8. (commit move maria maria car1 gedersdorf)
   added: (commitment move maria maria car1 gedersdorf)
   goals met: 1 of 2
9. (commit transfer-custody claudia bob apples wien)
   added: (commitment transfer-custody claudia bob apples wien)
   goals met: 1 of 2
10. (commit transfer-custody rolf claudia truck1 gedersdorf)
   added: (commitment transfer-custody rolf claudia truck1 gedersdorf)
   goals met: 1 of 2
11. (commit transfer-custody alice claudia apples rossatz)
   added: (commitment transfer-custody alice claudia apples rossatz)
   goals met: 1 of 2
12. (commit use claudia claudia truck1 gedersdorf)
   added: (commitment use claudia claudia truck1 gedersdorf)
   goals met: 1 of 2
13. (commit move claudia claudia truck1 wien)
   added: (commitment move claudia claudia truck1 wien)
   goals met: 1 of 2
14. (drive-recipe claudia truck1 krems rossatz)
   added: (intent use claudia claudia truck1 krems) (intent move claudia claudia truck1 rossatz)
   goals met: 1 of 2
15. (commit move claudia claudia truck1 rossatz)
   added: (commitment move claudia claudia truck1 rossatz)
   goals met: 1 of 2
16. (commit dismount maria claudia car1 gedersdorf)
   added: (commitment dismount maria claudia car1 gedersdorf)
   goals met: 1 of 2
17. (mount maria claudia car1 krems)
   added: (containedin claudia car1) (ispassive claudia) (fulfillment mount maria claudia car1 krems)
   goals met: 1 of 2
18. (move maria car1 krems gedersdorf)
   deleted: (currentlocation car1 krems) (currentlocation maria krems) (currentlocation claudia krems)
   added: (currentlocation car1 gedersdorf) (currentlocation maria gedersdorf) (fulfillment move maria maria car1 gedersdorf) (currentlocation claudia gedersdorf)
   goals met: 1 of 2
19. (dismount maria claudia car1 gedersdorf)
   deleted: (containedin claudia car1) (ispassive claudia)
   added: (fulfillment dismount maria claudia car1 gedersdorf)
   goals met: 1 of 2
20. (transfer-custody rolf claudia truck1 gedersdorf)
   deleted: (custodian truck1 rolf)
   added: (custodian truck1 claudia) (fulfillment transfer-custody rolf claudia truck1 gedersdorf)
   goals met: 0 of 2
21. (begin-use claudia truck1)
   added: (using claudia truck1) (fulfillment use claudia claudia truck1 ?l)
   goals met: 0 of 2
22. (move claudia truck1 gedersdorf rossatz)
   deleted: (currentlocation truck1 gedersdorf) (currentlocation claudia gedersdorf)
   added: (currentlocation truck1 rossatz) (currentlocation claudia rossatz) (fulfillment move claudia claudia truck1 rossatz)
   goals met: 0 of 2
23. (transfer-custody alice claudia apples rossatz)
   deleted: (custodian apples alice)
   added: (custodian apples claudia) (fulfillment transfer-custody alice claudia apples rossatz)
   goals met: 0 of 2
24. (drive-recipe claudia truck1 krems gedersdorf)
   added: (intent move claudia claudia truck1 gedersdorf)
   goals met: 0 of 2
25. (commit move claudia claudia truck1 gedersdorf)
   added: (commitment move claudia claudia truck1 gedersdorf)
   goals met: 0 of 2
26. (commit transfer-custody claudia rolf truck1 gedersdorf)
   added: (commitment transfer-custody claudia rolf truck1 gedersdorf)
   goals met: 0 of 2
27. (put-into claudia apples truck1)
   added: (containedin apples truck1)
   goals met: 0 of 2
28. (move claudia truck1 rossatz wien)
   deleted: (currentlocation truck1 rossatz) (currentlocation claudia rossatz) (currentlocation apples rossatz)
   added: (currentlocation truck1 wien) (currentlocation claudia wien) (fulfillment move claudia claudia truck1 wien) (currentlocation apples wien)
   goals met: 0 of 2
29. (take-out-of claudia apples truck1)
   deleted: (containedin apples truck1)
   goals met: 0 of 2
30. (transfer-custody claudia bob apples wien)
   deleted: (custodian apples claudia)
   added: (custodian apples bob) (fulfillment transfer-custody claudia bob apples wien)
   goals met: 1 of 2
31. (move claudia truck1 wien gedersdorf)
   deleted: (currentlocation truck1 wien) (currentlocation claudia wien)
   added: (currentlocation truck1 gedersdorf) (currentlocation claudia gedersdorf) (fulfillment move claudia claudia truck1 gedersdorf)
   goals met: 1 of 2
32. (transfer-custody claudia rolf truck1 gedersdorf)
   deleted: (custodian truck1 claudia)
   added: (custodian truck1 rolf) (fulfillment transfer-custody claudia rolf truck1 gedersdorf)
   goals met: 2 of 2
